{
  "resumeData": {
    "main": {
      "name": "Deepanshu Lulla",
      "occupation": "Back End Developer",
      "description": "My interests lie in creating and designing scalable,secure and fault resilient web systems",
      "image": "profilepic.jpg",
      "bio": "Deepanshu Lulla is a software engineer whoose interests lie in developing and maintaining large scale systems. His alma mater include Northeastern University, Boston, MA, USA and National Institute of technology,Bhopal,MP, India both premier and recognized institutes in their respective countries.He wishes to solve challenging problems of developing systems that really scale while ensuring they do not compromise in security aspects.He believes both scalability and security aren't someting that can be added later but need to be integrated in initial system design and requirements process.",
      "email": "deepanshu.lulla@gmail.com",
      "phone": "857-452-0190",
      "address": {
        "street": "",
        "city": "New York City",
        "state": "NY",
        "zip": "10016"
      },
      "website": "http://deepanshululla.com",
      "resumedownload": "https://www.dropbox.com/s/yrnbqa4hfts2q0y/Deepanshu%20Lulla%20software%20engineer.pdf?dl=0",
      "social": [
        {
          "name": "linkedin",
          "url": "http://linkedin.com/in/deepanshululla",
          "className": "fa fa-linkedin"
        },
        {
          "name": "github",
          "url": "http://github.com/deepanshululla",
          "className": "fa fa-github"
        }
      ]
    },
    "resume": {
      "education": [
        {
          "school": "Northeastern University,Boston,MA",
          "degree": "Masters(Computer Networking)",
          "graduated": "September 2017",
          "description": "Relevent courses: Computer networks, Network security, Cloud computing, Algorithms"
        },
        {
          "school": "MANIT(NIT Bhopal), India",
          "degree": "Bachelors(Electronics and Communication)",
          "graduated": "May 2014",
          "description": "Had 3 IEEE publication during undergrad level primarily focussed on Embedded systems and robotics"
        }
      ],
      "work": [
        {
          "company": "Oracle Technologies Inc.",
          "title": "Software Developer",
          "years": "Dec 2018 - Present",
          "description": [
            "Tech Stack: Python3, Celery, RabbitMQ, Postgres, Elasticsearch, Kubernetes, Prometheus, Grafana, helm, jenkins.",
            "- Implemented pipeline retry logic to automatically retry hanging or failed jobs hence decreasing downtime by 300%.",
            "- Developed API views for viewing the current status of ETL jobs and exposing them over rest API. ",
            "- Wrote custom Prometheus exporter to expose application pipeline metrics to monitor exceptions,latency of API and overall runtime of jobs."
          ] 
        },
        {
          "company": "Akamai Technologies Inc.",
          "title": "Software Engineer",
          "years": "Oct 2017 - Nov 2018",
          "description": [
            "- Designed and developed a monitoring platform using Python Flask, Influxdb, React to display the aggregate analysis of time series data.",
            "- Customized Open source monitoring tools like Telegraf, Grafana using Golang to meet the product’s monitoring requirements decreasing troubleshooting time during incidents by more than 50%.",
            "- CCM(Customer Cluster Mapper): Created REST API using Python Flask, Celery, Redis as well as a dashboard using REACT to map different customers to their respective clusters on AWS Opsworks."
          ]
        },
        {
          "company": "Dell EMC",
          "title": "Software Engineer Intern",
          "years": "May 2016 - December 2016",
          "description": ["Setup infrastructure for Active directory using VMWare ESXI. Worked on Storage protocols such as SAN, NFS, ISCSI "]
        }
      ],
      "skills": [
        {
          "name": "Back end development",
          "level": "70%"
        },
        {
          "name": "Front end development",
          "level": "50%"
        },
        {
          "name": "Machine learning",
          "level": "30%"
        },
        {
          "name": "Computer networking and security",
          "level": "70%"
        },
        {
          "name": "Cloud Services(Amazon Web services)",
          "level": "60%"
        },
        {
          "name": "Containerization(Docker,Kubernetes)",
          "level": "60%"
        },
        {
          "name": "Python",
          "level": "80%"
        },
        {
          "name": "Javascript",
          "level": "60%"
        },
        {
          "name": "React",
          "level": "60%"
        },
        {
          "name": "Flask",
          "level": "60%"
        },
        {
          "name": "Linux",
          "level": "60%"
        },
        {
          "name": "Relational Databases(MySql,Postgres)",
          "level": "70%"
        },
        {
          "name": "Non Relational Databases(Redis,Mongodb,Cassandra)",
          "level": "60%"
        },
        {
          "name": "Java",
          "level": "70%"
        },
        {
          "name": "Go",
          "level": "50%"
        },
        {
          "name": "Nodejs",
          "level": "50%"
        },
        {
          "name": "Spring Boot",
          "level": "40%"
        }
      ]
    },
    "portfolio": {
      "projects": [
        {
          "id": 1,
          "title": "Yelp Clone (Large social media application) using nodejs, mongodb,bootstrap",
          "description": "Created a large restful social media application with user registration,login and logout using passport js where users can have complete CRUD abilities of campgrounds posts and comments created by them.Implemented dynamic pricing for campgrounds and proper authentication and authorization by appropriate middleware. Added functionality to search through campgrounds and for resetting password.Used mongodb for backend database as well as bootstrap for styling. Added support for viewing campgrounds location using google maps.",
          "category": "Web Development",
          "tags": "Social media, Web Development, NodeJS, Mongodb",
          "image": "yelp.png",
          "url": "https://evening-basin-24316.herokuapp.com",
          "modal": "modal-01"
        },
        {
          "id": 2,
          "title": "Airline E-Commerce website using Java Spring boot, MYSQL, AngularJS and thymeleaf",
          "description": "Created a website clone for an Ecommerce airline web application using Spring boot, Spring data JPA(ORM) and MySQL. Added features to search and book flights.Created an REST API to serve an an integration layer for flight checkin microservice. Created the same microservice for passengers to check in.Encoded passwords to prevent them from being stored in plain text and defined roles for different types of users to perform authentication and authrorization.Added logging features and defined custom log rotation policies to log information to an external log file.Used AngularJs for form validations and two way binding",
          "category": "Web Development",
          "tags": "Web Development, Java, Spring-boot, Mysql, AngularJs",
          "image": "flight.jpg",
          "url": "https://github.com/deepanshululla/flight-reservation",
          "modal": "modal-02"
        },
        {
          "id": 3,
          "title": "Implementing Secure File Transfer Protocols in C with OPENSSL",
          "description": "Created self-signed RSA public/private keypair and used them to perform authenticated key agreement using Diffie-Hellman.Computed keys for HMAC(with SHA1 hash) and a shared secret key and IV for AES 256 bit CBC encryption using the exchanged secret.Performed file transfer over TCP sockets by three methods Encrypt and MAC (SSH style), Encrypt then MAC(IPSec-style) and MAC then Encrypt(TLS style).",
          "category": "Network Security",
          "tags": "Network programming, Security",
          "image": "openssl.jpg",
          "url": "https://github.com/deepanshululla/Network-security/tree/master/Secure%20File%20Transfer%20protocol%20in%20C",
          "modal": "modal-03"
        },
        {
          "id": 4,
          "title": "REST API for E-Commerce Store on Docker containers",
          "description": "Created a REST API with python flask and SQLALCHEMY as ORM using MySQL as the backend.Used docker compose for orchestrating python and MariaDB containers.Increased security by using JWT tokens for user authentication and authorization for specific requests.Used Postman for system testing and documenting the functionality of the REST API.Created unit,integration and system tests as well as makefile for test automation",
          "category": "Web Development",
          "tags": "REST API, Web Development, Backend Programming, Python, Flask, Mysql",
          "image": "restapi.jpg",
          "url": "https://github.com/deepanshululla/stores_rest_api_flask",
          "modal": "modal-04"
        },
        {
          "id": 5,
          "title": "Network Programability as a Cloud Service(Research project)",
          "description": "End Result: Successful Open Source Implementation of HAAS based scenario using Network Virtualisation and Software Defined Networking with multi tenant multi hardware provider scenario in collaboration with Cisco and Massachusetts Open Cloud (MOC) (Agile SDLC)Created Network Topologies and spawn instances in OpenStack to simulate the network environment.Improved the existing HaaS scenario by using a network virtualization layer (OpenVirtex) between controllers and OpenVSwitches to provide scale up and down across multiple hardware domains to tenants (IaaS providers).Created a mechanism based on Client-Server Model to synchronize NOSQL(Mongodb) database of different Hardware Domains.",
          "category": "Network Programming",
          "tags": "Opensource,Openvirtex,Software Defined Networks, Network virtualization",
          "image": "ovx.png",
          "url": "https://github.com/BU-NU-CLOUD-SP16/Network-Programmability-as-a-Service",
          "modal": "modal-05"
        },
        {
          "id": 6,
          "title": "Jenkins CI/CD Automation with Docker on AWS",
          "description": "Deployed Jenkins cluster installation on Docker containers with Docker running inside containers on AWS and created Job-DSLs for creating freestyle projects for testing Nodejs. Java Spring & Scala applications.Developed Jenkins scripted pipelines using Groovy to create an automated CI/CD pipeline by integrating plugins such as Github, Gradle, npm, Email integrations, Slack, Bitbucket, Jfrog artifactory, Blue ocean, Docker hub, Sonarcube etc.",
          "category": "CI/CD",
          "tags": "Jenkins, CI/CD, Docker",
          "image": "jenkins.png",
          "url": "https://github.com/deepanshululla/jenkinsAutomation",
          "modal": "modal-06"
        },
        {
          "id": 7,
          "title": "Blog Application using Python Flask, Docker-Compose,AWS, HTML,CSS, Javascript. (web development)",
          "description": "Created Blog Application using Python with authentication & authorization (Author login/logout) functionality as well as different page views for authors and readers using MYSQL as the database and Flask SQL Alchemy as ORM tool.\n Used docker for creating MySQL and application backend containers and docker-compose for orchestration.\n Created an isolated network for the Docker containers. The app was tested and deployed on AWS. Used NGINX for configuring HTTPS(SSL).Applied Jinja2 templating to support interaction between front and back end and to make front end more modular.Implemented front end using HTML, CSS, Bootstrap, Javascript.",
          "category": "Web Development",
          "tags": "Web Development, Python, Flask, MYSql",
          "image": "blog.jpg",
          "url": "https://github.com/deepanshululla/flask_blog_mysql",
          "modal": "modal-07"
        },
        {
          "id": 8,
          "title": "IMDB Clone Application using Nodejs, Express",
          "description": "Created a Movie search Application backend using Nodejs and express that searches for movies using OMDB REST API and displays them on a page.Constructed a front end using HTML, CSS, Bootstrap.Added movie page to see the information about each movie such as cast, IMDB rating etc.",
          "category": "Web Development",
          "tags": "Web Development, Javascript",
          "image": "imdb.jpg",
          "url": "https://imdb-clone-nodejs.herokuapp.com",
          "modal": "modal-08"
        }
      ]
    },
    "testimonials": {
      "testimonials": [
        {
          "text": "Deepanshu worked for me as a COOP at DELL EMC in 2016. He is a very quick and enthusiastic learner and very easy to work with. In a very short time, he was able to learn storage technology and was a valuable contributor to the team. He also learned VMware and setup the ESX server on his own. He reached out to team members when he needed help and worked well to adapt to changes. He worked on multiple projects and delivered on time. He will be an asset to any team and I will hire him in a minute if I had the chance!",
          "user": "Ms. Aparna Ramasundar(Manager at Dell EMC)"
        }
      ]
    }
  }
}
